{
  "storyId": "defuse-the-bomb",
  "metadata": {
    "title": "Defuse the Bomb!",
    "description": "An adventurous puzzle story where you must solve puzzles to defuse a glitter bomb set by your sibling.",
    "storyId": "defuse-the-bomb",
    "author": "AI Generated",
    "created": "2025-11-08"
  },
  "nodes": {
    "start": {
      "textFile": "nodes/start.txt",
      "choices": [
        {
          "text": "Solve the first puzzle",
          "nextNode": "colour-mix-challenge"
        }
      ],
      "image": "images/start.jpg",
      "text": "You stand in front of the glitter bomb, your adventurous spirit alight with the thrill of the challenge. The bomb is dazzling, shimmering with the promise of sparkling chaos. But you don't want your clothes, hair, or face covered in glitter today. Your dastardly older sibling has set this challenge up, ready to test your skills at cracking codes and solving puzzles. You're determined to defuse it, avoiding the glittery fate that hangs over you."
    },
    "colour-mix-challenge": {
      "textFile": "nodes/colour-mix-challenge.txt",
      "choices": [
        {
          "text": "Purple",
          "nextNode": "riddle-challenge"
        },
        {
          "text": "Orange",
          "nextNode": "glitter-failure"
        },
        {
          "text": "Green",
          "nextNode": "glitter-failure"
        }
      ],
      "image": "images/colour-mix-challenge.jpg",
      "text": "The first puzzle appears on a small screen. 'Mix the colours to find the key!' it reads. Below, you see three primary colours: red, blue, and yellow. You remember that mixing these can create new colours. The key to the next step is hidden in the secondary colour you get when you mix red and blue. Which one should you choose to move forward?"
    },
    "riddle-challenge": {
      "textFile": "nodes/riddle-challenge.txt",
      "choices": [
        {
          "text": "Echo",
          "nextNode": "math-challenge"
        },
        {
          "text": "Whisper",
          "nextNode": "glitter-failure"
        },
        {
          "text": "Leaf",
          "nextNode": "glitter-failure"
        },
        {
          "text": "Sound",
          "nextNode": "glitter-failure"
        }
      ],
      "image": "images/riddle-challenge.jpg",
      "text": "You've chosen wisely! The next screen lights up with a riddle. \"I speak without a mouth and hear without ears. I have no body, but I come alive with the wind. What am I?\" You pause to think. This puzzle is tricky, but you know the answer is the key to moving forward."
    },
    "math-challenge": {
      "textFile": "nodes/math-challenge.txt",
      "choices": [
        {
          "text": "8",
          "nextNode": "final-word-challenge"
        },
        {
          "text": "10",
          "nextNode": "glitter-failure"
        },
        {
          "text": "12",
          "nextNode": "glitter-failure"
        }
      ],
      "image": "images/math-challenge.jpg",
      "text": "You solved the riddle! Next, a math puzzle pops up. Emojis replace numbers in a quirky math problem. <br>🐱 + 🐱 = 4<br>🐶 + 🐱 = 6<br>🐶 + 🐶 = ? \n\nYou're supposed to find out what the double 🐶 equals to. Time to put on your thinking cap!"
    },
    "final-word-challenge": {
      "textFile": "nodes/final-word-challenge.txt",
      "choices": [
        {
          "text": "Piano",
          "nextNode": "success-ending"
        },
        {
          "text": "Map",
          "nextNode": "glitter-failure"
        },
        {
          "text": "Chest",
          "nextNode": "glitter-failure"
        },
        {
          "text": "Treasure",
          "nextNode": "glitter-failure"
        }
      ],
      "image": "images/final-word-challenge.jpg",
      "text": "You're almost there! The final challenge is a word puzzle. 'What has keys but can't open locks?' it asks. You remember hearing this one before. It's the last hurdle before you can defuse the bomb!"
    },
    "glitter-failure": {
      "textFile": "nodes/glitter-failure.txt",
      "choices": [],
      "image": "images/glitter-failure.jpg",
      "text": "Oh no! The bomb goes off, and you're showered in glitter. You look fabulous but it's not what you wanted. You realise your mistake: the correct answer was just a bit different. You laugh it off, remembering that even covered in glitter, you look like a dazzling disco ball! 'Well,' you chuckle, 'I guess I was born to stand out!'"
    },
    "success-ending": {
      "textFile": "nodes/success-ending.txt",
      "choices": [],
      "image": "images/success-ending.jpg",
      "text": "With the last answer correct, the bomb defuses with a satisfying click. You did it! You let out a triumphant cheer, tossing the glitter over your sibling in victory. They laugh, and you both celebrate the challenge you've overcome together. Glitter isn't so bad after all, especially when it's shared in joy. 'Next time, maybe I'll set the challenge!' you tease."
    }
  }
}